Autodesk.Navisworks.Api.ViewpointProjection
The projection type of the viewpoint

Autodesk.Navisworks.Api.ViewpointProjection.Perspective
Perspective viewpoint

Autodesk.Navisworks.Api.ViewpointProjection.Orthographic
Orthographic viewpoint